app/controllers/cities_controller.rb

INSERT INTO "cities" ("city_name", "city_state", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["city_name", "San Francisco"], ["city_state", "California"], ["created_at", 2016-10-07 21:38:24 UTC], ["updated_at", 2016-10-07 21:38:24 UTC]]
---
  def create
    @city = City.create(city_params)

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1 ORDER BY "posts"."created_at" DESC  [["city_id", 1]]
---
  def show
    @city = City.find_by_id(city_id)
    @posts = Post.where(city_id: city_id)