app/controllers/posts_controller.rb

  def index
    @posts = Post.where(city_id: params[:city_id]).order(created_at: :desc)
    @city = City.find_by(post_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1 ORDER BY "posts"."created_at" DESC  [["city_id", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."city_id" = $1 LIMIT $2  [["city_id", "1"], ["LIMIT", 1]]

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id", "city_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "testing"], ["content", "helllloooo"], ["created_at", 2016-10-09 22:24:17 UTC], ["updated_at", 2016-10-09 22:24:17 UTC], ["user_id", 1], ["city_id", 1]]

  def show
    @post = Post.find_by_id(post_id)
    @city = City.find_by_id(post_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @post = Post.find_by_id(post_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @post = Post.find_by_id(post_id)
    @city = City.find_by_id(post_id)

    @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "city_id" = $2, "user_id" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["content", "testing the content sectionssss"], ["city_id", 3], ["user_id", 7], ["updated_at", 2016-10-11 04:42:53 UTC], ["id", 3]]

  def destroy
    @post = Post.find_by_id(post_id)
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]