app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."city_id" = $1 ORDER BY "posts"."id" ASC LIMIT $2  [["city_id", 2], ["LIMIT", 1000]]
---
  def index
    @posts = Post.where(city_id: params[:city_id]).find_each