app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "wnamen"], ["password_digest", "$2a$10$SG6ERFguNdxyQjcwARN/AujBlHSU6awFQQ3GHu2BC3V4egk77uIQ6"], ["created_at", 2016-10-07 07:06:31 UTC], ["updated_at", 2016-10-07 07:06:31 UTC]]

  def show
    @user = User.find_by_id(user_id)
    @posts = Post.where(user_id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]

  def edit
    @user = User.find_by_id(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    user = User.find_by_id(user_id)
    user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "MattTHE MAN"], ["updated_at", 2016-10-12 00:16:38 UTC], ["id", 7]]