app/views/cities/index.html.haml

    %h2.text-center All Cities
    - @cities.each do |city|
      .card.city_card
---
SELECT "cities".* FROM "cities"